## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/a187047850bfc18b27cb7d8a08863c3609faea76" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/a187047850bfc18b27cb7d8a08863c3609faea76" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJWHV6NThrUkhuNTh3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJOemd6TkRRM09EWXdOamd4TURFeU56VTNNQ0FYRFRJeU1Ea3hPREEwTVRNMU5sb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWTNPRE0wTkRjNE5qQTJPREV3TVRJM05UY3dnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRFVYYitDeW8yZkZaUi9ONHVYNVM5azJoZ1AKM1VueHVwMUhzRU16UXZ5U2FlbHdyaWtBakQxcEUzS1ZTa0pBRHhmR3NocXVUV1pmeGRjb21GRWpUd1RMRSs1SQpMOGR3aHlnR2VONWI4SmprOHZqK1pKTzltMko5SVVKNFJJbUg5clYrV2VKWFZLNzhhZjdaSjNOdzYrRU1YWGluCjlMUDErOWt0T0ZKR2FZVjJONWhmbzVQZDJmS2dpRitzdlY5SS9rcThqbHRLNXFjUzlaaTh6dDhPcGVIaHNUZXEKOFNIZ2tlWEZKMFJqenhqQXJVbktNUEFvekhGbTRKcktMZTRSRjlFL3F2VG92NFdWNU5vZ3pycG9FbnBIQ2pvYQo1OTBjN3FGUXJ2aXdlZks3YmlFK1Z6aVVPMTRTbWtwMC9qR3l0Y2ZNQnplR2xPMUhYRGV0OWc1aVBubVpBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQU1ady95MDdpVWpEVUt1K3haOFRqVgo0S3JscGo3endkczRPcDczRWZZcG5JVTBSYm15K3Q2ancveGNQUmdhWElsRG5CTWpvdTFXaVloSUdFWjRqQmNmCmZVZ3NhaTByVnNBd2Q5a3poVUVPRlZELzMrSk9jTWZIV2szb3djdG1vc29yVmxGbXZWcllMOWw5RHZyQis4dmYKVFkyS09nbGVzMU5wdlM2WG1ET1VYM043djVjbGl5dlNXaXVuK1hQS1F5SnRVM2UzZHBUSEZDaWEvbFRxNWt0cgpIQTBGNEF6dzBFL1IzMjJ0b0d4VGE0SzhsVzhxU0VsWW90TEtxZVhzYmpXTkhjYzN4K1E4UEIyeHZKUHlhS0xQCmNzUWFkZlc1MjA4Tm51SUtaYmUzM1pMU3Mrc2EyWVgyRkdLTHNEbUVZZWtCRk5rUkZaODJJWE9NTWViblJOY2EKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T04:13:56Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be updated in-place
!   resource "google_container_node_pool" "pools" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema/nodePools/core"
        name                        = "core"
        # (10 unchanged attributes hidden)

!       autoscaling {
!           max_node_count       = 6 -> 12
!           min_node_count       = 4 -> 6
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components_destroy[0] will be created
+   resource "null_resource" "additional_components_destroy" {
+       id       = (known after apply)
+       triggers = {
+           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
+   resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "1"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] will be created
+   resource "null_resource" "run_command" {
+       id       = (known after apply)
+       triggers = {
+           "arguments"             = "77a2b10d38c550faf4633c35dc8107fd"
+           "create_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
+           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
+           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
+   resource "null_resource" "run_destroy_command" {
+       id       = (known after apply)
+       triggers = {
+           "destroy_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
+           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

Plan: 7 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
